"use client";
import s from "./GetSection.module.css";
import Image from "next/image";
import { useTranslation } from 'react-i18next';

const pointsUa = [
  "Сертифікат про завершення курсу",
  "Практичні знання з догляду та розвитку дітей",
  "Розуміння професійної етики та способів ефективної роботи в родині",
  "Навички з педіатрії, психології, педагогіки та комунікації",
  "Готові інструкції для роботи з дітьми різного віку",
  "Поради з працевлаштування та розвитку кар’єри",
];

export const GetSection = () => {
  const { t } = useTranslation('common');
  const points = Array.isArray(t('get_points', { returnObjects: true })) ? t('get_points', { returnObjects: true }) as string[] : pointsUa;
  return (
    <section className={s.section}>
      <div className={s.imageContainer}>
        <Image
          alt="Worm"
          width={1920}
          height={1080}
          priority
          src="/icons/border-worm.svg"
          className={s.worm}
        />

        <Image
          alt="Kid"
          width={1920}
          height={1080}
          priority
          src="/images/get-kid.jpg"
          className={s.image}
        />
      </div>
      <div className={s.contentContainer}>
        <h2>
          {t('get_title')}
          <Image
            width={1920}
            height={1080}
            src="/icons/three-month.svg"
            alt="Three month"
          />
        </h2>

        <ul className={s.list}>
          {points.map((point: string, index: number) => (
            <li key={index}>
              {star}
              <p>{point}</p>
            </li>
          ))}
        </ul>

        <div className={s.desc}>
          <span>{t('get_subtitle_1')}</span>
          <span>{t('get_subtitle_2')}</span>
          {line}
        </div>
      </div>
      <Image
        width={1920}
        height={1080}
        src="/images/pinkCloud2.png"
        alt="cloud"
        className={s.cloud1}
      />
      <Image
        width={1920}
        height={1080}
        src="/images/pinkCloud1.png"
        alt="cloud"
        className={s.cloud2}
      />
    </section>
  );
};

const star = (
  <svg viewBox="0 0 32 33" fill="none" xmlns="http://www.w3.org/2000/svg">
    <g clipPath="url(#clip0_729_4694)">
      <path
        d="M30.4714 11.6469C27.1805 11.6469 23.8895 11.6827 20.5985 11.7184C19.3465 8.35592 18.0945 4.95763 16.9141 1.55935C16.6994 0.915469 15.6263 0.593526 15.3044 1.34473C13.802 4.81455 12.2996 8.28437 10.9045 11.8257C7.82815 11.8973 4.75181 11.9688 1.71124 12.0404C0.81696 12.0761 0.173075 13.2924 0.924274 13.9362C1.99742 14.8305 3.03478 15.7606 4.07215 16.7264C4.96644 17.5492 5.82495 18.4077 6.68347 19.302C7.00541 19.6597 7.47044 20.0532 7.72084 20.4824C8.04278 21.0548 7.68506 21.5556 7.47044 22.0921C6.25421 25.1685 5.1453 28.3163 4.07215 31.4642C3.75021 32.3585 4.93067 33.2886 5.71764 32.752C8.07855 31.1781 10.4752 29.6041 12.8719 28.1017C13.5873 27.6725 14.3028 27.2074 15.0182 26.7782C15.6979 26.3847 15.8052 26.492 16.4491 26.8855C16.9856 27.2074 17.5222 27.5651 18.023 27.9229C20.2766 29.4968 22.3513 31.2496 24.7122 32.6805C25.4277 33.1097 26.2862 32.3943 26.0715 31.6431C25.4634 29.2464 24.8911 26.8855 24.3903 24.453C24.1399 23.2368 23.7464 21.9133 23.6749 20.697C23.6391 19.5881 24.6407 19.0873 25.3919 18.4434C27.3235 16.7622 29.2194 15.0452 31.1153 13.2924C31.7592 12.6843 31.2584 11.6469 30.4714 11.6469ZM23.4602 17.6922C22.6375 18.3719 22.0294 19.0516 21.9221 20.1247C21.8148 21.3409 22.2082 22.7002 22.4586 23.9165C22.8521 25.8481 23.2814 27.7798 23.7464 29.7114C22.0652 28.4594 20.527 27.1001 18.8457 25.8481C17.8441 25.1327 16.6637 24.0953 15.3759 24.2384C14.3743 24.3457 13.4085 25.1327 12.5857 25.6335C10.8329 26.7066 9.08015 27.8155 7.32735 28.9602C7.43466 28.6741 7.50621 28.4237 7.61352 28.1375C8.36472 25.9912 9.36632 23.8807 10.0102 21.6986C10.7256 19.2662 7.75661 17.1199 6.21844 15.6533C5.68187 15.1525 5.1453 14.6517 4.57295 14.1509C6.71924 14.0793 8.82975 14.1509 10.976 13.9362C13.2654 13.7216 14.6963 6.9966 15.984 4.13489C16.9856 7.06815 18.023 10.0014 19.0604 12.8989C19.2034 13.2924 19.5254 13.6143 19.9904 13.6143C22.709 13.6143 25.4277 13.5785 28.1105 13.5428C26.5723 14.9736 25.0342 16.3687 23.4602 17.6922Z"
        fill="black"
      />
    </g>
    <defs>
      <clipPath id="clip0_729_4694">
        <rect
          width="32"
          height="32"
          fill="white"
          transform="translate(0 0.910156)"
        />
      </clipPath>
    </defs>
  </svg>
);

const line = (
  <svg
    width="628"
    height="15"
    viewBox="0 0 628 15"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M2 9.90499C2.93541 8.05717 19.1024 6.82604 24.9022 6.34866C37.7759 5.28904 47.5751 3.60854 61.4985 3.60854C69.9572 3.60854 105.681 1.7388 87.47 5.35886C82.7776 6.29166 82.7729 5.77047 80.3495 6.81767C77.0301 8.25207 83.0515 7.19703 86.8424 7.08002C105.551 6.50257 121.658 6.68791 140.594 6.29166C171.244 5.65028 205.526 6.92431 235.756 5.53263C258.405 4.48993 282.12 4.57185 304.661 3.60849C319.596 2.97019 334.66 2.15098 349.875 2.15098C354.901 2.15098 367.182 1.41295 366.757 3.20039C366.524 4.17499 354.17 5.4562 350.819 5.82391C347.125 6.22932 327.766 7.92273 334.882 7.92273C366.843 7.92273 396.604 6.27314 427.908 4.7745C454.739 3.49001 481.87 4.54438 509.128 4.54438C541.079 4.54438 571.543 5.21638 603.688 5.21638C615.918 5.21638 626 4.12475 626 7.57755C626 8.65616 625.543 9.8175 623.747 10.8084M623.747 10.8084C623.637 10.869 623.523 10.9289 623.403 10.9881C622.395 11.4859 613.661 13.7185 615.375 12.7663C616.937 11.8984 619.971 11.2772 623.747 10.8084Z"
      stroke="#FF91B2"
      strokeWidth="3"
      strokeLinecap="round"
    />
  </svg>
);
