"use client";

import Link from "next/link";
import Image from "next/image";
import { motion, easeOut } from "framer-motion";
import { Breadcrumbs } from "@/components/Breadcrumbs/Breadcrumbs";
import { btnSvg } from '@/components/BtnSvg';
import s from "./not-found.module.css";
import { useTranslation } from 'react-i18next';
import { useParams } from 'next/navigation';

const svg = (
  <svg
    className={s.svg}
    viewBox="0 0 70 63"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M35.3242 25.1965C38.1848 25.1965 41.1059 23.7613 43.5635 22.385C47.3697 20.2535 51.3 18.6058 55.0438 16.2934C59.7508 13.3862 63.9755 9.85823 68.3594 6.57031"
      stroke="#ACE2FF"
      strokeWidth="3"
      strokeLinecap="round"
    />
    <path
      d="M40.9453 32.5759C44.7005 32.5759 48.4557 32.5759 52.2108 32.5759C54.8782 32.5759 57.4234 32.5542 60.0596 32.244C61.178 32.1124 62.1161 32.358 63.0859 31.873"
      stroke="#ACE2FF"
      strokeWidth="3"
      strokeLinecap="round"
    />
    <path
      d="M1.5 13.2578C7.77273 16.2578 12 17.7578 18.1043 21.8452C26.5 29.2578 31.3451 35.838 33.6457 45.0401C35.4987 52.4525 36 53.7578 36 60.7578"
      stroke="#ACE2FF"
      strokeWidth="3"
      strokeLinecap="round"
    />
    <path
      d="M31.8086 16.7604C31.915 15.8032 33.456 14.7615 34.1125 14.1051C35.3643 12.8532 36.3939 11.4722 37.6464 10.2197C39.5028 8.36334 41.0648 6.0353 42.6251 3.91338C43.1375 3.2165 43.6988 2.38078 44.4604 2"
      stroke="#ACE2FF"
      strokeWidth="3"
      strokeLinecap="round"
    />
  </svg>
);

const containerVariants = {
  hidden: {},
  show: {
    transition: {
      staggerChildren: 0.18,
    },
  },
};

const itemVariants = {
  hidden: { opacity: 0, y: 30 },
  show: { opacity: 1, y: 0, transition: { duration: 0.7, ease: easeOut } },
};

export default function NotFound() {
  const { t } = useTranslation('common');
  const { locale } = useParams<{ locale: string }>();

  return (
    <>
      <main className={s.mainNotFound}>
        <Breadcrumbs
          items={[
            { label: t('breadcrumbs_home'), href: `/${locale}` },
            { label: t('breadcrumbs_404'), active: true },
          ]}
          colorScheme="dark"
        />
        <span className={s.pinkBlob}>
        <svg viewBox="0 0 284 287" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M158.635 260.691C148.874 250.367 143.163 238.129 141.578 224.014C140.186 211.51 142.987 199.844 149.068 188.865C152.234 183.137 155.8 177.625 158.155 171.476C160.614 165.056 159.161 161.679 153.069 158.704C145.667 155.102 137.718 154.783 129.742 154.639C111.34 154.303 94.3699 149.879 80.6417 136.939C70.2978 127.173 63.8296 115.019 60.6514 101.19C54.8222 75.7848 61.3965 52.5909 73.9205 30.5196C77.0942 24.9342 80.191 19.3583 84.7342 14.6423C90.3213 8.81929 100.931 7.70149 107.67 10.6562C119.143 15.6838 124.183 28.0502 119.242 39.4781C117.008 44.6331 112.664 48.3462 109.182 52.6232C101.112 62.5785 95.6086 73.6891 95.0765 86.5818C94.525 99.8353 98.8985 111.236 110.828 118.265C117.727 122.328 125.765 122.605 133.59 123.085C147.47 123.946 161.008 126.311 172.536 134.601C189.435 146.749 194.193 164.134 186.819 183.624C184.136 190.707 180.64 197.435 177.827 204.451C175.27 210.814 175.575 216.938 179.29 222.81C181.707 226.633 184.928 228.83 189.532 229.445C201.283 231.019 210.922 243.771 209.148 255.03C207.065 268.232 195.395 277.702 182.988 276.092C175.634 275.139 170.172 270.469 164.637 266.126C162.52 264.454 160.629 262.502 158.647 260.68L158.635 260.691Z" fill="#FF91B2"/>
        <path d="M187.495 246.211C188.259 247.009 189.525 247.036 190.323 246.272C191.121 245.508 191.148 244.242 190.384 243.444C189.619 242.647 188.353 242.619 187.556 243.384C186.758 244.148 186.731 245.414 187.495 246.211Z" fill="black"/>
        <path d="M183.495 263.211C184.259 264.009 185.525 264.036 186.323 263.272C187.121 262.508 187.148 261.242 186.384 260.444C185.619 259.647 184.353 259.619 183.556 260.384C182.758 261.148 182.731 262.414 183.495 263.211Z" fill="black"/>
        </svg>

        </span>
        <motion.div
          className={s.content}
          variants={containerVariants}
          initial="hidden"
          animate="show"
        >
          <motion.h1 variants={itemVariants}>
            {svg}
            404
          </motion.h1>

          <motion.p variants={itemVariants}>
          Здається, ви потрапили не туди. Але не хвилюйтеся 
          ми допоможемо знайти шлях додому.
          </motion.p>

          <motion.div variants={itemVariants}>
            <Link href="/" className={s.btn}>
              <div className={s.first}>{btnSvg}</div>
              Головна
              <div className={s.second}>{btnSvg}</div>
            </Link>
          </motion.div>
          <Image
            alt="Plate"
            width={1920}
            height={1080}
            priority
            src="/icons/plate.svg"
            className={s.plate}
          />
          <Image
            alt="Worm"
            width={1920}
            height={1080}
            priority
            src="/icons/worm.svg"
            className={s.worm}
          />
        </motion.div>
        <span className={s.blueBlob}>
        <svg viewBox="0 0 343 303" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M204.472 214.234C175.382 196.268 160.538 171.535 157.543 139.448C156.662 129.998 155.81 120.541 154.685 111.126C153.497 101.175 149.745 92.6087 139.765 88.5897C129.059 84.2768 119.075 86.3324 109.852 93.011C93.2335 105.008 88.8343 122.441 88.0664 141.548C87.7341 149.699 90.1156 157.798 87.4912 166.045C83.0548 179.97 68.9006 189.206 54.5873 186.795C38.8038 184.132 29.6887 174.138 28.4154 158.137C26.3343 131.956 30.6863 106.9 43.7229 84.019C60.9386 53.8132 86.2114 34.6594 121.844 32.4695C145.344 31.0202 166.021 39.0232 182.763 55.563C197.42 70.0767 203.335 88.5836 204.847 108.907C205.738 121.051 205.207 133.247 207.113 145.355C211.924 175.975 246.991 191.938 273.236 175.362C277.5 172.669 281.482 169.688 285.079 166.211C291.292 160.185 302.074 159.288 309.458 164.273C317.556 169.745 320.8 179.837 316.972 188.361C312.677 197.909 304.817 204.379 296.375 209.79C265.999 229.26 234.751 230.57 204.461 214.252L204.472 214.234Z" fill="#ACE2FF"/>
        <path d="M74.7407 155.85C73.261 154.996 71.3676 155.505 70.5116 156.987C69.6556 158.47 70.1613 160.364 71.641 161.219C73.1208 162.073 75.0142 161.564 75.8702 160.081C76.7261 158.599 76.2205 156.704 74.7407 155.85Z" fill="black"/>
        <path d="M50.9322 155.451C49.4524 154.597 47.559 155.106 46.703 156.589C45.8471 158.072 46.3527 159.966 47.8324 160.82C49.3122 161.675 51.2056 161.165 52.0616 159.683C52.9175 158.2 52.4119 156.306 50.9322 155.451Z" fill="black"/>
        </svg>
        </span>
      </main>
    </>
  );
} 