export const courseModules = [
  {
    module: 1,
    title: "Яка оплата і як часто вона надходить?",
    duration: "35 хв",
    lessons: 3,
    lectures: [
      "Вступ",
      "Про професію няні",
      "Обов’язки няні",
      "Професійна етика",
    ],
    result:
      "Після проходження ви зрозумієте свою роль, чітко знатимете обов’язки няні та значення професійної етики у роботі з родиною.",
    previewImage: "/images/program-item-video.jpg",
  },
  {
    module: 2,
    title: "Педіатрія",
    duration: "35 хв",
    lessons: 3,
    lectures: [
      "Основи дитячого здоровʼя",
      "Гігієна та догляд",
      "Ознаки хвороб та коли звертатись до лікаря",
    ],
    result:
      "Ви навчитесь розпізнавати перші симптоми захворювань, доглядати за дитиною в різному віці та дотримуватись рекомендацій педіатрів.",
    previewImage: "/images/program-item-video.jpg",
  },
  {
    module: 3,
    title: "Дитяча психологія",
    duration: "35 хв",
    lessons: 3,
    lectures: [
      "Вікові особливості дітей",
      "Як будувати контакт з дитиною",
      "Емоційна підтримка та стабільність",
    ],
    result:
      "Опануєте базові принципи дитячої психології та знатимете, як підтримувати дитину в різних ситуаціях.",
    previewImage: "/images/program-item-video.jpg",
  },
  {
    module: 4,
    title: "Методики раннього розвитку",
    duration: "35 хв",
    lessons: 3,
    lectures: [
      "Монтессорі та Вальдорф",
      "Раннє навчання через гру",
      "Розвиток мовлення та моторики",
    ],
    result:
      "Дізнаєтесь про ефективні підходи до розвитку дітей до 3 років, зможете підібрати техніки під конкретну сімʼю.",
    previewImage: "/images/program-item-video.jpg",
  },
  {
    module: 5,
    title: "Розвивальні ігри та заняття",
    duration: "35 хв",
    lessons: 3,
    lectures: [
      "Ігрові методики навчання",
      "Заняття вдома з підручними матеріалами",
      "Створення розкладу активностей",
    ],
    result:
      "Зможете проводити цікаві розвивальні ігри та створювати індивідуальні заняття відповідно до віку дитини.",
    previewImage: "/images/program-item-video.jpg",
  },
  {
    module: 6,
    title: "Гармонійна робота в родині",
    duration: "35 хв",
    lessons: 3,
    lectures: [
      "Комунікація з батьками",
      "Розмежування ролей у сімʼї",
      "Як поводитись у конфліктних ситуаціях",
    ],
    result:
      "Навчитесь будувати здорові відносини з батьками, вести професійний діалог і уникати непорозумінь.",
    previewImage: "/images/program-item-video.jpg",
  },
  {
    module: 7,
    title: "Професійний розвиток няні",
    duration: "35 хв",
    lessons: 3,
    lectures: [
      "Як вдосконалювати навички",
      "Сертифікації та курси",
      "Побудова карʼєри",
    ],
    result:
      "Отримаєте мотивацію до розвитку, дізнаєтесь про можливості для зростання та підтримання високого рівня як спеціаліста.",
    previewImage: "/images/program-item-video.jpg",
  },
];
