export const nanniesData = [
  {
    title: "Няня для хлопчика",
    price: "20000-35000 грн",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-ПТ, повна зайнятість",
    description:
      "Шукаємо турботливу, відповідальну няню для дитини віком 2 років. Родина проживає в Києві, потрібна няня з досвідом і любов’ю до дітей. Графік повний, оплата гідна.",
  },
  {
    title: "Няня для хлопчика",
    price: "Від 400 грн/год",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-ПТ, неповна зайнятість",
    description:
      "Шукаємо турботливу, відповідальну няню для дитини віком 2 років. Родина проживає в Києві, потрібна гнучка зайнятість. Няня має бути активною, пунктуальною, з досвідом.",
  },
  {
    title: "Няня для хлопчика зі знанням англійської",
    price: "20000-35000 грн",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-СР, повна зайнятість",
    description:
      "Шукаємо турботливу няню зі знанням англійської для хлопчика 2 років. Важливо вміти проводити активний час з дитиною, гратись, читати, займатись розвитком.",
  },
  {
    title: "Няня для хлопчика",
    price: "20000-35000 грн",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-ПТ, повна зайнятість",
    description:
      "Шукаємо турботливу, відповідальну няню для дитини віком 2 років. Родина проживає в Києві, потрібна няня з досвідом і любов’ю до дітей. Графік повний, оплата гідна.",
  },
  {
    title: "Няня для хлопчика",
    price: "Від 400 грн/год",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-ПТ, неповна зайнятість",
    description:
      "Шукаємо турботливу, відповідальну няню для дитини віком 2 років. Родина проживає в Києві, потрібна гнучка зайнятість. Няня має бути активною, пунктуальною, з досвідом.",
  },
  {
    title: "Няня для хлопчика зі знанням англійської",
    price: "20000-35000 грн",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-СР, повна зайнятість",
    description:
      "Шукаємо турботливу няню зі знанням англійської для хлопчика 2 років. Важливо вміти проводити активний час з дитиною, гратись, читати, займатись розвитком. Шукаємо турботливу няню зі знанням англійської для хлопчика 2 років. Важливо вміти проводити активний час з дитиною, гратись, читати, займатись розвитком. Шукаємо турботливу няню зі знанням англійської для хлопчика 2 років. Важливо вміти проводити активний час з дитиною, гратись, читати, займатись розвитком. ",
  },
  {
    title: "Няня для хлопчика",
    price: "20000-35000 грн",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-ПТ, повна зайнятість",
    description:
      "Шукаємо турботливу, відповідальну няню для дитини віком 2 років. Родина проживає в Києві, потрібна няня з досвідом і любов’ю до дітей. Графік повний, оплата гідна.",
  },
  {
    title: "Няня для хлопчика",
    price: "Від 400 грн/год",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-ПТ, неповна зайнятість",
    description:
      "Шукаємо турботливу, відповідальну няню для дитини віком 2 років. Родина проживає в Києві, потрібна гнучка зайнятість. Няня має бути активною, пунктуальною, з досвідом.",
  },
  {
    title: "Няня для хлопчика зі знанням англійської",
    price: "20000-35000 грн",
    location: "Україна, м. Київ, район Оболонь",
    schedule: "ПН-СР, повна зайнятість",
    description:
      "Шукаємо турботливу няню зі знанням англійської для хлопчика 2 років. Важливо вміти проводити активний час з дитиною, гратись, читати, займатись розвитком.",
  },
];
