export const storiesData = [
  {
    slug: "tvorchyj-vechir-1",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/1.jpg",
  },
  {
    slug: "tvorchyj-vechir-2",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/2.jpg",
  },
  {
    slug: "tvorchyj-vechir-3",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/3.jpg",
  },
  {
    slug: "tvorchyj-vechir-4",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/4.jpg",
  },
  {
    slug: "tvorchyj-vechir-5",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/1.jpg",
  },
  {
    slug: "tvorchyj-vechir-6",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/2.jpg",
  },
  {
    slug: "tvorchyj-vechir-7",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/3.jpg",
  },
  {
    slug: "tvorchyj-vechir-8",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/4.jpg",
  },
  {
    slug: "tvorchyj-vechir-9",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/1.jpg",
  },
  {
    slug: "tvorchyj-vechir-10",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/2.jpg",
  },
  {
    slug: "tvorchyj-vechir-11",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/3.jpg",
  },
  {
    slug: "tvorchyj-vechir-12",
    date: "03.03.2025",
    category: "Навчання та поради",
    title: "Наша няня Катерина організувала творчий вечір",
    description:
      "Минулими вихідними наша няня Марія провела яскравий майстер-клас із малювання для дітей від 4 до 6 років.",
    image: "/images/blog/4.jpg",
  },
];
